/* 
*******************************************************************************
*= = 文件名称：HelloDRIVER.h 
*= = 文件描述：关于HelloDRIVER的头文件 
*= = 作    者：竹林蹊径 
*= = 编写时间：2009-04-23 21:16:00 
*******************************************************************************
*/ 

#ifndef __HELLODRIVER_H__
#define __HELLODRIVER_H__

//*============================================================================ 
//*= = 头文件声明 
//*============================================================================ 

#include <NTDDK.h>

//*============================================================================ 
//*= = 宏与结构体 
//*============================================================================ 

typedef struct _DEVICE_EXTENSION {

    PDEVICE_OBJECT DeviceObject;    // 指回设备对象的指针 
    UNICODE_STRING DeviceName;      // 设备名称 
    UNICODE_STRING SymbolicLink;    // 符号链接名 
          
}DEVICE_EXTENSION, *PDEVICE_EXTENSION;

//*============================================================================ 
//*= = 函数声明 
//*============================================================================

NTSTATUS
DriverEntry (
    __in PDRIVER_OBJECT DriverObject,
    __in PUNICODE_STRING RegistryPath
    );

VOID
DriverUnload (
    __in PDRIVER_OBJECT DriverObject
    );
    
NTSTATUS
DefaultDispatch (
    __in PDEVICE_OBJECT DeviceObject,
    __in PIRP Irp
    );

#endif  // End of __HELLODRIVER_H__ 

//*============================================================================ 
//*= = 文件结束 
//*============================================================================ 
