/******************************************************************

  Chapter 1. 扩加俊 措茄 家俺 

	1) 单捞磐 傈价  
	2) 单捞磐 荐脚 
	3) example(傈价)
	4) example(荐脚)
******************************************************************/



//---------------------------------------------------------------- 
//   0) 单捞磐 傈价  
//---------------------------------------------------------------- 
/*
     *)单捞磐 傈价 窃荐 
     单捞磐甫 焊郴绰 窃荐	: send()
	 单捞磐甫 罐绰 窃荐		: recv()
	 犬厘 窃荐  : WSA*(*)

    []  价脚 滚欺, 荐脚 滚欺 
	阿阿 磊脚苞 惑措规狼 IP 林家客 PORT 锅龋 
	价荐脚 滚欺啊 粮犁 
	价脚 滚欺(send buffer) 单捞磐甫 傈价窍扁 傈俊 烙矫肺 历厘秦滴绰 康开
	荐脚 滚欺(receive buffer) 罐篮 单捞磐甫 局敲府纳捞记捞 贸府窍扁 傈鳖
	      瘤 烙矫肺 历厘秦 滴绰 康开 

    => 笛阑 钦媚辑 家南 滚欺(socket buffer)扼 茄促.
	send()/recv()绰 家南阑 烹秦 埃立利栏肺 家南 滚欺甫 立辟且 荐 乐档废
	 父电 窃荐扼 杭 荐 乐促.
*/



//---------------------------------------------------------------- 
//   1) 单捞磐 傈价  
//---------------------------------------------------------------- 
/*
	send & WSASend

	SOCKET_ERROR 甫 府畔 => WSAGetLastError() 龋免 窍咯 俊矾 盔牢 犬牢

    林肺 惯积登绰 俊矾 
		WSAECONNABORTED & WSAECONNRESET
		鸥烙酒眶捞唱 惑措规狼 立加 辆丰俊 狼秦 惯积 

	int send(
		SOCKET			s,
		const char FAR *buf,
		int				len,
		int				flags
	);

	1牢磊) 单捞磐甫 傈价窍辨 盔窍绰 楷搬等 家南
	2牢磊) 傈价且 单捞磐啊 淬变 char屈 滚欺 
	3牢磊) len篮 傈价且 单捞磐狼 农扁 
	4牢磊) 0

	府畔蔼 : 己傍矫 傈价等 剧捞 府畔 
			 角菩矫 SOCKET_ERROR 府畔 
				

	int WSASend(
		SOCKET								s,
		LPWSABUF							lpBuffers,
		DWORD								dwBufferCount,
		LPDWORD								lpNumberOfBytesSent,
		DWORD								dwFlags,
		LPWSAOVERLAPPED						lpOverlapped,
		LPWSAOVERLPAPPED_COMPLETION_ROUTINE	lpCompletionRoutine

	);
	
	1牢磊) 单捞磐甫 傈价窍辨 盔窍绰 楷搬等 家南
	2牢磊) 窍唱 捞惑狼 备炼眉 WSABuffer狼 器牢磐
			窍唱狼 备炼眉 器牢磐唱 备炼眉 硅凯狼 器牢磐 啊瓷 
	3牢磊) 备炼眉 WSABUF狼 俺荐 
	4牢磊) WSASend甫 烹秦 傈价等 单捞磐 醚 农扁 府畔 
	5牢磊) 0
	6牢磊) 漂荐 牢磊(厚悼扁)
	7牢磊) 漂荐 牢磊(厚悼扁)

   
	府畔蔼 : 己傍矫 0 
			 角菩矫 SOCKET_ERROR 府畔 



    *) 霉锅掳 牢磊肺 荤侩茄 家南狼 漂己俊 蝶扼 滴 辆幅狼 己傍利牢 
	   府畔阑  茄促.
	   1) 喉肺欧(blocking) 家南
	      瘤陛鳖瘤 积己茄 葛电 家南捞 咯扁俊 秦寸
		    send() 窃荐 龋瓔
			价脚 滚欺狼 咯蜡 傍埃捞 技 锅掳 牢磊焊促 利阑 版快 
			 秦寸 橇肺技胶绰 措扁惑怕(wait state)啊 等促.
			价脚 滚欺俊 面盒茄 傍埃捞 积扁搁 橇肺技胶绰 柄绢唱绊, 
			len 农扁父怒 单捞磐 汗荤啊 捞风绢 柳饶 
			send() 窃荐啊 府畔等促.
			府畔蔼篮 len() 苞 悼老窍促.

        2) 惩喉肺欧(non blocking) 家南
		  ioctlsocket() 喉肺欧 家南阑 惩喉肺欧 家南栏肺 官曹 荐 乐促.
		   send() 窃荐 龋免
		   价脚 滚欺狼 咯蜡 傍埃父怒 单捞磐甫 汗荤 茄 饶 
		   角力 汗荤茄 单捞磐 官捞飘 荐甫 府畔 
		   捞 版快 send() 窃荐狼 府畔蔼篮 弥家 1, 弥措 len捞等促.

*/




//---------------------------------------------------------------- 
//   2) 单捞磐 荐脚
//---------------------------------------------------------------- 
/*
	recv & WSARecv

	int recv(
		SOCKET		s,
		char FAR	*buf,
		int			len;
		int			flag
	);

    1牢磊) 单捞磐甫 荐脚且 家南
	2牢磊) 荐脚等 单捞磐甫 淬阑 char屈 滚欺
	3牢磊) 荐脚窍辨 盔窍绰 农扁 or 滚欺狼 农扁
	4牢磊) 0

	府畔蔼 : 己傍矫 荐脚等 剧捞 府畔 
			 角菩矫 SOCKET_ERROR 府畔 



  int WSARecv(
		SOCKET								s,
		LPWSABUF							lpBuffers,
		DWORD								dwBufferCount,
		LPDWORD								lpNumberOfBytesRecv,
		DWORD								dwFlags,
		LPWSAOVERLAPPED						lpOverlapped,
		LPWSAOVERLPAPPED_COMPLETION_ROUTINE	lpCompletionRoutine
	);
	
	1牢磊) 单捞磐甫 荐脚窍辨 盔窍绰 楷搬等 家南
	2牢磊) 窍唱 捞惑狼 备炼眉 WSABuffer狼 器牢磐
			窍唱狼 备炼眉 器牢磐唱 备炼眉 硅凯狼 器牢磐 啊瓷 
	3牢磊) 备炼眉 WSABUF狼 俺荐 
	4牢磊) WSASend甫 烹秦 荐脚等 单捞磐 醚 农扁 府畔 
	5牢磊) 0
	6牢磊) 漂荐 牢磊(厚悼扁)
	7牢磊) 漂荐 牢磊(厚悼扁)

   
	府畔蔼 : 己傍矫 0 
			 角菩矫 SOCKET_ERROR 府畔 
*/



//---------------------------------------------------------------- 
//	3) example(价脚)
//---------------------------------------------------------------- 
/*
	send窃荐甫 捞侩窍咯 2048官捞飘父怒狼 单捞磐 价脚

*/

/*
void main()
{


	// 1. 扩加 扼捞宏矾府 2.2 檬扁拳
	// 2. 楷搬阑 扁促府扁 困茄 家南 积己
	// 3. bind 窍扁 困茄 林家 瘤沥 棺 bind
	// 4. 辑滚俊 楷搬

	
	char	sendbuff[2048];
	int		nBytes		= 2048;

	//sendbuff俊 2048父怒狼 单捞磐甫 盲款促.
	ret	= send(s, sendbuff, nBytes, 0 );

	// 5. 家南 秦力
	// 6. 扩加 荤侩 辆丰 
}
	//  矫胶袍篮 价荐脚阑 困窍咯 沥秦柳 剧父怒狼 滚欺甫
	    家南俊 且寸窍扁 锭巩俊 府畔蔼 ret绰 傈价等 剧父怒狼 
	    箭磊肺 汲沥等促.

		捞 版快 郴何滚欺绰 单捞磐啊 匙飘焢 急肺肺 唱啊扁 傈
		鳖瘤 单捞磐甫 焊包窍绰 开且阑 茄促. 
	
		TCP/IP俊辑绰 扩档快 农扁甫 烹秦 傈价瞪 单捞磐 剧捞 
		搬沥等促.( TCP/IP window size)
		荐脚螟狼 郴何滚欺啊 菜 盲况廉 乐促搁 牢档快 农扁绰 0栏肺
		汲沥登绊, 0焊促 目龙锭鳖瘤 单捞磐 傈价捞 阂啊瓷秦柳促.
*/


/*
void main()
{

	
	char	sendbuff[2048];
	int		nBytes		= 2048,
			nLeft,
			idx;


	//sendbuff俊 2048父怒狼 单捞磐甫 盲款促.

	nLeft	= nBytes;
	idx		= 0;

	while( nLeft > 0 )
	{
		ret	= send(s, &sendbuff[idx], nLeft, 0 );
		if( ret	== SOCKET_ERROR)
		{
			// error Handling
		}
		nLeft	-= ret;
		idx		+= ret;
	}

}
*/



//---------------------------------------------------------------- 
//	4) example(荐脚)
//---------------------------------------------------------------- 


/*
void main()
{


	// 1. 扩加 扼捞宏矾府 2.2 檬扁拳
	// 2. 楷搬阑 扁促府扁 困茄 家南 积己
	// 3. bind 窍扁 困茄 林家 瘤沥 棺 bind
	// 4. 辑滚俊 楷搬

	
	char	recvbuff[2048];
	int		nBytes		= 2048;

	//sendbuff俊 2048父怒狼 单捞磐甫 盲款促.
	ret	= recv(s, recvbuff, nBytes, 0 );

	// 5. 家南 秦力
	// 6. 扩加 荤侩 辆丰 
}
*/


/*
void main()
{
	char	recvbuff[2048];
	int		nBytes		= 2048,
			nLeft,
			idx;

	//sendbuff俊 2048父怒狼 单捞磐甫 盲款促.
	nLeft	= nBytes;
	idx		= 0;

	while( nLeft > 0 )
	{
		ret	= recv(s, &recvbuff[idx], nLeft, 0 );
		if( ret	== SOCKET_ERROR)
		{
			// error Handling
		}
		nLeft	-= ret;
		idx		+= ret;
	}
}


// 皋矫瘤 农扁啊 啊函利捞扼搁??



  
//---------------------------------------------------------------- 
    *) 局敲府纳捞记 橇肺配妮苞 皋矫瘤 汲拌
//---------------------------------------------------------------- 

   TCP 辑滚/努扼捞攫飘狼 扁夯 备炼绰 沥屈拳登绢 乐促.
   蝶扼辑 老窜 阿 窃荐狼 狼固甫 捞秦窍绊 唱搁 焕措啊 登绰 内靛绰 
   弊措肺 汗荤秦辑 荤侩且 荐 乐促.

   弊犯促搁 局敲府纳捞记狼 绊蜡茄 扁瓷阑 搬沥窍绰 何盒篮 绢叼老鳖?
   官肺 单捞磐 贸府 何盒捞促. 
    
   埃窜茄 颇老 傈价 橇肺弊伐阑 累己窍搁辑 局敲府纳捞记 橇肺配妮狼 
   俺充苞 皋矫瘤 汲拌矫 林狼痢阑 犬牢秦 焊磊. 

1) 局敲府纳捞记 橇肺配妮
   局敲府纳捞记 荐霖(application-level) 俊辑 林绊 罐绰 单捞磐狼 屈侥苞
   狼固 弊府绊 贸府 规侥 殿阑 沥狼茄 橇肺配妮捞促.

   局敲府纳捞记 橇肺配妮狼 扁夯篮 林绊罐阑 皋矫瘤 屈侥阑 沥窍绰 巴捞促.
   父距 匙飘况农甫 烹秦 磊脚狼 拳搁苞 惑措规 拳搁阑 悼矫俊 弊覆阑 弊副
   荐 乐绰 扁瓷阑 力傍窍妨搁 绢栋茄 单捞磐甫 林绊 罐酒具 且鳖?
   - 急狼 矫累苞 场痢 
   - 滴膊客 祸惑 
   => 备炼眉肺 钎泅秦 焊磊.
      struct DrawMessage1
	  {
		int x1, y1;		// 急狼 矫累痢
		int x2, y2;		// 急狼 场痢
		int width;		// 急狼 滴膊
		int color;		// 急 祸惑
	  };

    父距 盔 弊府扁 扁瓷阑 眠啊茄促搁 ??
	- 盔狼 吝缴 谅钎
	- 盔狼 馆瘤抚
	- 郴何 祸惑
	- 滴膊 祸惑
	=> 备炼眉肺 钎泅秦 焊磊
	struct DrawMessage2
	{
		int x1, y1;	// 盔狼 吝缴 谅钎
		int r;		// 盔狼 馆瘤抚
		int fillcolor;	// 郴何 祸惑
		int width;		// 急 滴膊
		int color;		// 急 祸惑
	};

    捞客 鞍捞 沥狼窍搁 匙飘况农甫 烹秦 单捞磐甫 罐篮 率俊辑绰 绢恫 
	鸥涝牢瘤甫 备盒且 荐 绝澜栏肺 弥辆利栏肺 酒贰客 鞍捞 鞘靛甫
	利侩矫难轻 茄促.
      struct DrawMessage1
	  {
		int type;		/// = LINE
		int x1, y1;		// 急狼 矫累痢
		int x2, y2;		// 急狼 场痢
		int width;		// 急狼 滴膊
		int color;		// 急 祸惑
	  };
	struct DrawMessage2
	{
		int type;		// = CIRCLE
		int x1, y1;	// 盔狼 吝缴 谅钎
		int r;		// 盔狼 馆瘤抚
		int fillcolor;	// 郴何 祸惑
		int width;		// 急 滴膊
		int color;		// 急 祸惑
	};


2) 皋矫瘤 汲拌

   (1)
   烹脚 剧窜捞 林绊罐阑 单捞磐 夸家甫 备炼眉肺 沥狼窍绰 巴栏肺绰
   面盒窍瘤 臼促.

   (2)
   皋矫瘤 汲拌矫 绊妨秦具 且 荤亲阑 舅酒焊磊
   * 版拌备盒捞 绝绰 TCP 橇肺配妮阑 荤侩且 版快 , 局敲府纳捞记俊辑
     捞何盒狼 贸府甫 秦具 茄促. 酒贰狼 3啊瘤 规过阑 犬牢秦 焊磊.

  [ 价脚磊  ]
     - 亲惑 绊沥 辨捞 单捞磐甫 焊辰促.
	 - 版拌 备盒阑 困秦 漂喊茄 钎矫(EOR, End of Recored)甫 火涝茄促.
	 - 焊尘 单捞磐狼 辨捞甫 绊沥 辨捞 单捞磐肺 焊辰 饶, 
	   啊函 辨捞 单捞磐甫 捞绢辑 焊辰促.
  
   [ 荐脚磊 ]
      - 亲惑 绊沥 辨捞 单捞磐甫 罐绰促.
	  - EOR捞 唱棵锭鳖瘤 单捞磐甫 佬篮 饶 贸府茄促.
	  - 绊沥 辨捞 单捞磐甫 佬绢 第蝶扼棵 单捞磐狼 辨捞甫 舅酒辰促.
	    捞 辨捞父怒 啊函 辨捞 单捞磐甫 佬绢 贸府茄促.


    规过 1)
	价脚磊客 荐脚磊啊 贸府 窍扁俊 啊厘 祈茄 规过捞促.
	窍瘤父 啊厘 变 单捞磐甫 绊沥 辨捞肺 沥秦具 窍绰 巩力啊 乐促.
	惑措利栏肺 辨捞啊 陋篮 单捞磐甫 林绊 罐阑 版快 扯厚登绰 何盒捞 
	积变促.

    规过 2) 
	价脚磊客 荐脚磊 率俊辑 单捞磐甫 贸府窍扁 奖瘤 臼篮 巩力啊 乐促.
	霉掳, 价脚磊 率俊辑绰 单捞磐 吝埃俊 EOR苞 度鞍篮 菩畔捞 乐阑 版快甫
	漂喊窍霸 贸府秦 林绢具 茄促.
	笛, 荐脚磊 率俊辑绰 单捞磐甫 茄 官捞飘究 佬绢辑 贸府秦具 窃栏肺 
	瓤啦己捞 冻绢柳促.
	肚茄 单捞磐俊 加茄 EOR牢瘤, 版拌甫 唱鸥郴绰 EOR牢瘤 备盒窍绰
	累诀档 鞘夸窍促.

    规过 3)
	备泅窍扁档 奖绊 瓤啦己档 臭栏骨肺 老馆利栏肺 腹捞 荤侩茄促.

   

    (3) 官捞飘 沥纺
	捞扁辆 埃 矫胶袍 荤捞 单捞磐 背券矫 官捞飘 沥纺 规侥阑 烹老秦具 
	茄促.
	漂喊茄 傈力啊 绝促搁 候 浚叼救 规侥栏肺 烹老窍绰 巴捞 亮促.

    (4) 干滚 沥纺
	struct MyMessage
	{
		int a;	// 4
		char b;	// 1	 
		int c;	// 4
		char d;	// 1
	};
	sizeof => 16捞 唱柯促.
	-> 剧率捞 悼老茄 备炼眉 干滚 沥纺 规侥阑 荤侩茄促搁 巩力啊 登瘤 臼
	绰促.
	漂喊茄 捞蜡肺 牢秦 沥犬洒 10byte甫 焊郴妨 茄促搁 促澜苞 鞍捞 哪颇
	老矾俊霸 疙飞阑 荤侩窍搁 等促.
	#pragma pack(1)	// 干滚 沥纺 规侥 傈券 : 1byte 版拌 
	struct MyMessage
	{
		int a;	// 4
		char b;	// 1	 
		int c;	// 4
		char d;	// 1
	};
	#pragma pack()		// 叼弃飘 干滚 沥纺 规侥栏肺 汗蓖 

   => 傈眉 函版档 啊瓷 -> 厚鼻厘
      Project => setting => C/C++ => Code generation => 
	  struct member alignment



  [ 夸距 ]
/*
1. TCP 辑滚俊 TCP 努扼捞攫飘啊 立加窍搁 概锅 货肺款 家南捞 积己登哥, 
   捞 家南捞 角力 单捞磐 傈价俊 荤侩等促.
2. TCP/IP 甫 捞侩窍咯 局敲府纳捞记捞 烹脚阑 荐青窍扁 困秦辑绰 橇肺配妮,
   瘤开 IP 林家客 瘤开 器飘锅龋, 盔搬 IP 林家客 盔拜 器飘锅龋殿捞
   搬沥登绢具 茄促.

3. TCP 辑滚狼 林夸 窃荐绰 
   socket(), bind(), listen(), accept(), recv(), send(), 
   closesocket() 捞促.
4. bind() 窃荐绰 辑滚狼 瘤开 IP 林家客 瘤开 器飘 锅龋甫 搬沥茄促.
5. listen() 窃荐绰 家南苞 搬钦等 TCP 器飘 惑怕甫 LISTENNING栏肺 
   官槽促.
6. accept() 窃荐绰 辑滚俊 立加茄 努扼捞攫飘客 烹脚且 荐 乐档废
   货肺款 家南阑 积己窍咯 府畔茄促.
7. TCP 努扼捞攫飘狼 林夸 窃荐绰 socket(), connect(), recv(), send(), 
   closesocket()捞促.

8. connect() 窃荐绰 努扼捞攫飘啊 辑滚俊霸 立加窍咯 TCP 橇肺配妮 
   荐霖狼 楷搬捞 捞风绢瘤档废 茄促.
9. send()窃荐绰 局敲府纳捞记 单捞磐甫 价脚 滚欺俊 汗荤窃栏肺结 
   泵必利栏肺 窍何 橇肺配妮俊 狼秦(TCP/IP) 单捞磐啊 傈价登档废 茄促.
10. sned() 窃荐绰 霉锅掳 牢磊肺 荤侩茄 家南狼 漂己(喉矾欧, 惩喉矾欧)
  俊 蝶扼 滴 辆幅狼 己傍利牢 府畔阑 且 荐 乐促.
11. recv() 窃荐绰 荐脚 滚欺俊 档馒茄 单捞磐甫 局敲府纳捞记 滚欺肺 
   汗荤茄促.

12. recv() 窃荐绰 惑炔俊 蝶扼 滴 辆幅狼 己傍利牢 府畔阑 且 荐 乐促.
13. 局敲府纳捞记 橇肺配妮篮 局敲府纳捞记 荐霖俊辑 林绊罐绰 单捞磐狼 
   屈侥苞 狼固 弊府绊 贸府 规侥 殿阑 沥狼茄 橇肺配妮捞促.
14. TCP 客 鞍捞 皋矫瘤狼 版拌 备盒阑 窍瘤 臼绰 橇肺配妮阑 荤侩且 版快,
    局敲府纳捞记 荐霖俊辑 捞甫 贸府秦具 茄促.
15. 辑肺 促弗 官捞飘 沥纺 规侥阑 荤侩窍绰 矫胶袍 荤捞俊 单捞磐甫 
   背券且 锭绰 官捞飘 沥纺 规侥阑 烹老秦具 茄促.
16.干滚 沥纺捞鄂 备炼眉 干滚狼 矫累 林家俊 措茄 力距 荤亲阑 
   狼固茄促. 剧率 橇肺弊伐捞 悼老茄 备炼眉 干滚 沥纺 规侥阑 荤侩窍瘤 
   臼阑 版快 巩力啊 瞪 荐 乐促.
*/