/* 
******************************************************************************* 
*= = 文件名称：HelloWorld.c 
*= = 文件描述：驱动程序的HelloWorld例子 
*= = 作    者：竹林蹊径 
*= = 编写时间：2009-04-23 21:16:00 
******************************************************************************* 
*/ 

#include <NTDDK.h> 

//*============================================================================
//*= = 函数名称：DriverEntry 
//*= = 功能描述：驱动程序入口函数 
//*= = 入口参数：PDRIVER_OBJECT, PUNICODE_STRING 
//*= = 出口参数：NTSTATUS 
//*============================================================================

NTSTATUS
DriverEntry (
    __in PDRIVER_OBJECT DriverObject,
    __in PUNICODE_STRING RegistryPath
    )
{
    DbgPrint("Hello, Windows Driver!");
    return STATUS_SUCCESS;
}

//*============================================================================
//*= = 文件结束 
//*============================================================================
